{ "type": "class",
  "qname": "mx.core.FlexVersion",
  "baseClassname": ""
  ,
    "description": "This class controls the backward-compatibility of the framework. With every new release, some aspects of the framework such as behaviors, styles, and default settings, are changed which can affect your application. By setting the <code>compatibilityVersion</code> property, the behavior can be changed to match previous releases. This is a 'global' flag; you cannot apply one version to one component or group of components and a different version to another component or group of components.",
  "tags": [
  {  "tagName": "playerversion",
         "values": ["Flash 9", "AIR 1.1"]},
      {  "tagName": "productversion",
         "values": ["Flex 3"]},
      {  "tagName": "langversion",
         "values": ["3.0"]}  ],
  "members": [
  { "type": "field",
        "qname": "VERSION_3_0",
        "return": "uint",
        "namespace": "public",
        "bindable": [],
        "details": ["static"],
        "deprecated": {},
          "description": "The <code>compatibilityVersion</code> value of Flex 3.0, encoded numerically as a <code>uint</code>. Code can compare this constant against the <code>compatibilityVersion</code> to implement version-specific behavior.",
        "tags": [
        {  "tagName": "playerversion",
               "values": ["Flash 9", "AIR 1.1"]},
            {  "tagName": "productversion",
               "values": ["Flex 3"]},
            {  "tagName": "langversion",
               "values": ["3.0"]}  ]},
      { "type": "accessor",
        "access": "read-write",
        "return": "uint",
        "qname": "compatibilityVersion",
        "namespace": "public",
        "bindable": [],
        "details": ["static"],
        "deprecated": {},
          "description": "The current version that the framework maintains compatibility for. This defaults to <code>CURRENT_VERSION</code>. It can be changed only once; changing it a second time results in a call to the <code>compatibilityErrorFunction()</code> method if it exists, or results in a runtime error. Changing it after the <code>compatibilityVersion</code> property has been read results in an error because code that is dependent on the version has already run. There are no notifications; the assumption is that this is set only once, and this it is set early enough that no code that depends on it has run yet.",
        "tags": [
        {  "tagName": "default",
               "values": ["FlexVersion.CURRENT_VERSION"]},
            {  "tagName": "playerversion",
               "values": ["Flash 9", "AIR 1.1"]},
            {  "tagName": "productversion",
               "values": ["Flex 3"]},
            {  "tagName": "langversion",
               "values": ["3.0"]}  ]}]
  }
