{ "type": "interface",
  "qname": "mx.managers.ISystemManager",
"baseInterfaceNames": [
"org.apache.royale.events.IEventDispatcher", 
"mx.core.IChildList"]
,
    "description": "An ISystemManager manages an &quot;application window&quot;. Every application that runs on the desktop or in a browser has an area where the visuals of the application will be displayed.  It may be a window in the operating system or an area within the browser.  That is an &quot;application window&quot; and different from an instance of <code>mx.core.Application</code>, which is the main &quot;top-level&quot; window within an application.  <p>Every application has an ISystemManager. The ISystemManager  sends an event if the size of the application window changes (you cannot change it from within the application, but only through interaction with the operating system window or browser).  It parents all displayable items within the application, such as the main mx.core.Application instance and all popups, tooltips, cursors, an so on.  Any object parented by the ISystemManager is considered to be a &quot;top-level&quot; window, even tooltips and cursors.</p>  <p>The ISystemManager also switches focus between top-level windows if there  are more than one IFocusManagerContainer displayed and users are interacting with components within the IFocusManagerContainers.</p>  <p>All keyboard and mouse activity that is not expressly trapped is seen by the ISystemManager, making it a good place to monitor activity should you need to do so.</p>  <p>If an application is loaded into another application, an ISystemManager will still be created, but will not manage an &quot;application window&quot;, depending on security and domain rules. Instead, it will be the <code>content</code> of the <code>Loader</code> that loaded it and simply serve as the parent of the sub-application</p>  <p>The ISystemManager maintains multiple lists of children, one each for tooltips, cursors, popup windows. This is how it ensures that popup windows &quot;float&quot; above the main application windows and that tooltips &quot;float&quot; above that and cursors above that. If you examine the <code>numChildren</code> property or <code>getChildAt()</code> method on the ISystemManager you are accessing the main application window and any other windows that aren't popped up. To get the list of all windows, including popups, tooltips and cursors, use the <code>rawChildren</code> property.</p>",
  "tags": [
  {  "tagName": "playerversion",
         "values": ["Flash 9", "AIR 1.1"]},
      {  "tagName": "productversion",
         "values": ["Royale 0.9.4"]},
      {  "tagName": "langversion",
         "values": ["3.0"]}  ],
  "members": [
  { "type": "accessor",
    "access": "read-write",
    "return": "Object",
    "qname": "mxmlDocument",
    "namespace": "public",
    "bindable": [],
    "details": [],
    "deprecated": {},
      "description": "A reference to the document object. A document object is an Object at the top of the hierarchy of a Flex application, MXML component, or AS component.",
    "tags": [
    {  "tagName": "playerversion",
           "values": ["Flash 9", "AIR 1.1"]},
        {  "tagName": "productversion",
           "values": ["Royale 0.9.4"]},
        {  "tagName": "langversion",
           "values": ["3.0"]}  ]},
  { "type": "accessor",
    "access": "read-only",
    "return": "mx.core.IChildList",
    "qname": "rawChildren",
    "namespace": "public",
    "bindable": [],
    "details": [],
    "deprecated": {}},
  { "type": "accessor",
    "access": "read-write",
    "return": "int",
    "qname": "numModalWindows",
    "namespace": "public",
    "bindable": [],
    "details": [],
    "deprecated": {}},
  { "type": "method",
    "qname": "getSandboxRoot",
    "namespace": "public",
    "bindable": [],
    "details": [],
    "deprecated": {},
      "description": "Gets the system manager that is the root of all top level system managers in this SecurityDomain.",
    "tags": [
    {  "tagName": "playerversion",
           "values": ["Flash 9", "AIR 1.1"]},
        {  "tagName": "productversion",
           "values": ["Royale 0.9.4"]},
        {  "tagName": "return",
           "values": ["the highest-level systemManager in the sandbox"]},
        {  "tagName": "langversion",
           "values": ["3.0"]}  ],
      "return": "Object",
      "params": []}
  ]
  }
